app/controllers/recursos_controller.rb

  def index
    @categories = Category.all
    @steam_areas = %w[ Ciencia Tecnología Ingeniería Arte Matemáticas ]

    if params[:category_id].present? &&
      @resources = Recurso.where(category_id: params[category_id])
---
SELECT "recursos".* FROM "recursos" WHERE "recursos"."category" = ?  [["category", "Ciencia"]]