app/views/recursos/index.html.erb


<%= Recurso::CATEGORIES.each do |categoria| %>
---
SELECT "recursos".* FROM "recursos" WHERE "recursos"."categoria" = ?  [["categoria", "Ciencia"]]

  <ul>
    <% Recurso.where(categoria: categoria).each do |resource| %>
---
SELECT "recursos".* FROM "recursos" WHERE "recursos"."categoria" = ?  [["categoria", "Ciencia"]]